Revit 2027 API
ParameterTypeId.ViewModelDisplayMode Property
 "Display Model"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewModelDisplayMode { get; }
Public Shared ReadOnly Property ViewModelDisplayMode As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewModelDisplayMode {
	ForgeTypeId^ get ();
}
static member ViewModelDisplayMode : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace